In [380]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
print("setup completed")

setup completed

In [294]:
df1=pd.read_csv(r"C:\Users\Suleman\Downloads\bengaluru_house_prices.csv")
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [295]:
list(df1.columns)

['area_type',
 'availability',
 'location',
 'size',
 'society',
 'total_sqft',
 'bath',
 'balcony',
 'price']

In [296]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [297]:
df1.shape

(13320, 9)

# data cleaning

In [298]:
# anlayzing columns wise
df.groupby('area_type')['area_type'].count()

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [299]:
df2=df1.drop(['area_type','availability','society','balcony'],axis=1)
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [300]:
# data cleaning

In [301]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [302]:
df3=df2.dropna()
df3

                       location       size total_sqft  bath   price
0      Electronic City Phase II      2 BHK       1056   2.0   39.07
1              Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2                   Uttarahalli      3 BHK       1440   2.0   62.00
3            Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                      Kothanur      2 BHK       1200   2.0   51.00
...                         ...        ...        ...   ...     ...
13315                Whitefield  5 Bedroom       3453   4.0  231.00
13316             Richards Town      4 BHK       3600   5.0  400.00
13317     Raja Rajeshwari Nagar      2 BHK       1141   2.0   60.00
13318           Padmanabhanagar      4 BHK       4689   4.0  488.00
13319              Doddathoguru      1 BHK        550   1.0   17.00

[13246 rows x 5 columns]

In [303]:
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [304]:
df3['size'].describe()

count     13246
unique       31
top       2 BHK
freq       5198
Name: size, dtype: object

In [305]:
df3['size'].value_counts()

size
2 BHK         5198
3 BHK         4286
4 Bedroom      818
4 BHK          577
3 Bedroom      546
1 BHK          531
2 Bedroom      329
5 Bedroom      296
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           57
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [306]:
df3['bhk']=df3['size'].apply(lambda x:int(x.split(' ')[0]))

C:\Users\Suleman\AppData\Local\Temp\ipykernel_1096\4200255786.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bhk']=df3['size'].apply(lambda x:int(x.split(' ')[0]))

In [307]:
df3.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [308]:
del(df3['size'])

In [309]:
df3.head()

                   location total_sqft  bath   price  bhk
0  Electronic City Phase II       1056   2.0   39.07    2
1          Chikka Tirupathi       2600   5.0  120.00    4
2               Uttarahalli       1440   2.0   62.00    3
3        Lingadheeranahalli       1521   3.0   95.00    3
4                  Kothanur       1200   2.0   51.00    2

In [310]:
sorted(df3['bhk'].unique())

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16, 18, 19, 27, 43]

In [195]:
# next column TOTAL SQUAREFEET

In [311]:
df3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [312]:
df3.head()

                   location total_sqft  bath   price  bhk
0  Electronic City Phase II       1056   2.0   39.07    2
1          Chikka Tirupathi       2600   5.0  120.00    4
2               Uttarahalli       1440   2.0   62.00    3
3        Lingadheeranahalli       1521   3.0   95.00    3
4                  Kothanur       1200   2.0   51.00    2

In [314]:
# some values are not in format eg:'1133 - 1384' etc
'''lets contvert the object type of 'total_sqft' into float,
so the concept is , any number having non numeric 
or special characters won't be conveted in float'''

"lets contvert the object type of 'total_sqft' into float,\nso the concept is , any number having non numeric \nor special characters won't be conveted in float"

In [315]:
# create a function for above case
def is_float(val):
    try:
        float(val)
    except:
        return False
    # we will return TRUE if the try executes
    return True

# NOTE ::: ~(NEGATION) it will return opposite of retrived output

In [316]:
sqft_str=df3[~df3['total_sqft'].apply(is_float)]
sqft_str

                 location   total_sqft  bath    price  bhk
30              Yelahanka  2100 - 2850   4.0  186.000    4
122                Hebbal  3067 - 8156   4.0  477.000    4
137    8th Phase JP Nagar  1042 - 1105   2.0   54.005    2
165              Sarjapur  1145 - 1340   2.0   43.490    2
188              KR Puram  1015 - 1540   2.0   56.800    2
...                   ...          ...   ...      ...  ...
12975          Whitefield   850 - 1060   2.0   38.190    2
12990      Talaghattapura  1804 - 2273   3.0  122.000    3
13059              Harlur  1200 - 1470   2.0   72.760    2
13265               Hoodi  1133 - 1384   2.0   59.135    2
13299          Whitefield  2830 - 2882   5.0  154.500    4

[190 rows x 5 columns]

In [319]:
list(sqft_str['total_sqft'].unique())

['2100 - 2850',
 '3067 - 8156',
 '1042 - 1105',
 '1145 - 1340',
 '1015 - 1540',
 '34.46Sq. Meter',
 '1195 - 1440',
 '4125Perch',
 '1120 - 1145',
 '3090 - 5002',
 '1160 - 1195',
 '1000Sq. Meter',
 '1115 - 1130',
 '1100Sq. Yards',
 '520 - 645',
 '1000 - 1285',
 '650 - 665',
 '633 - 666',
 '5.31Acres',
 '30Acres',
 '1445 - 1455',
 '884 - 1116',
 '850 - 1093',
 '716Sq. Meter',
 '547.34 - 827.31',
 '580 - 650',
 '3425 - 3435',
 '1804 - 2273',
 '3630 - 3800',
 '4000 - 5249',
 '1500Sq. Meter',
 '142.61Sq. Meter',
 '1574Sq. Yards',
 '1250 - 1305',
 '670 - 980',
 '1005.03 - 1252.49',
 '1004 - 1204',
 '361.33Sq. Yards',
 '645 - 936',
 '2710 - 3360',
 '2830 - 2882',
 '596 - 804',
 '1255 - 1863',
 '1300 - 1405',
 '117Sq. Yards',
 '934 - 1437',
 '980 - 1030',
 '2249.81 - 4112.19',
 '1070 - 1315',
 '3040Sq. Meter',
 '500Sq. Yards',
 '2806 - 3019',
 '613 - 648',
 '704 - 730',
 '1210 - 1477',
 '3369 - 3464',
 '1125 - 1500',
 '167Sq. Meter',
 '1076 - 1199',
 '381 - 535',
 '524 - 894',
 '540 - 670',
 '315Sq. Yards',
 '2725 - 3250',
 '888 - 1290',
 '660 - 700',
 '385 - 440',
 '770 - 841',
 '3Cents',
 '188.89Sq. Yards',
 '1469 - 1766',
 '204Sq. Meter',
 '1255 - 1350',
 '870 - 1080',
 '45Sq. Yards',
 '133.3Sq. Yards',
 '2580 - 2591',
 '2563 - 2733',
 '605 - 624',
 '1349 - 3324',
 '78.03Sq. Meter',
 '3300 - 3335',
 '1180 - 1630',
 '1365 - 1700',
 '122Sq. Yards',
 '84.53Sq. Meter',
 '2.09Acres',
 '981 - 1249',
 '1565 - 1595',
 '24Guntha',
 '1270 - 1275',
 '840 - 1010',
 '697Sq. Meter',
 '655 - 742',
 '1408 - 1455',
 '942 - 1117',
 '598 - 958',
 '1500Cents',
 '132Sq. Yards',
 '1010 - 1300',
 '2Acres',
 '1450 - 1950',
 '1100Sq. Meter',
 '15Acres',
 '763 - 805',
 '3307 - 3464',
 '1.26Acres',
 '620 - 934',
 '2462 - 2467',
 '540 - 740',
 '3508 - 4201',
 '4900 - 4940',
 '755 - 770',
 '664 - 722',
 '151.11Sq. Yards',
 '596 - 861',
 '615 - 985',
 '540 - 565',
 '750 - 800',
 '1660 - 1805',
 '1079 - 1183',
 '2800 - 2870',
 '1230 - 1290',
 '943 - 1220',
 '2041 - 2090',
 '527 - 639',
 '1Grounds',
 '1160 - 1315',
 '706 - 716',
 '2940Sq. Yards',
 '45.06Sq. Meter',
 '799 - 803',
 '2470 - 2790',
 '783 - 943',
 '4500 - 5540',
 '1255 - 1375',
 '610 - 615',
 '854 - 960',
 '2650 - 2990',
 '1.25Acres',
 '86.72Sq. Meter',
 '1230 - 1490',
 '660 - 780',
 '1150 - 1194',
 '684 - 810',
 '1510 - 1670',
 '1550 - 1590',
 '1235 - 1410',
 '38Guntha',
 '929 - 1078',
 '2150 - 2225',
 '1520 - 1759',
 '629 - 1026',
 '1215 - 1495',
 '6Acres',
 '1140 - 1250',
 '2400 - 2600',
 '1052 - 1322',
 '5666 - 5669',
 '712 - 938',
 '1783 - 1878',
 '120Sq. Yards',
 '24Sq. Meter',
 '2528 - 3188',
 '650 - 760',
 '1400 - 1421',
 '4000 - 4450',
 '142.84Sq. Meter',
 '300Sq. Yards',
 '1437 - 1629',
 '850 - 1060',
 '1200 - 1470',
 '1133 - 1384']

In [320]:
''' convert ' - ' separateds range sqftarea values in a average '''
def convert_rangesqft_to_avg(x):
    token=x.split('-')
    if len(token)==2:
        return (float(token[0])+float(token[1])) / 2
    try :
        return float(x)
    except:
        return None

'''it can also be done using lamda funcion '''
df3['total_sqft'].apply(lambda x:(float(x.split('-')[0])+ float(x.split('-')[1]))/2 )

In [322]:
convert_rangesqft_to_avg('1133 - 1384')

1258.5

In [323]:
df4=df3.copy()
df4['total_sqft']=df4['total_sqft'].apply(convert_rangesqft_to_avg)
df4.head()

                   location  total_sqft  bath   price  bhk
0  Electronic City Phase II      1056.0   2.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0  120.00    4
2               Uttarahalli      1440.0   2.0   62.00    3
3        Lingadheeranahalli      1521.0   3.0   95.00    3
4                  Kothanur      1200.0   2.0   51.00    2

In [324]:
df4['total_sqft'].unique()

array([1056. , 2600. , 1440. , ..., 1258.5,  774. , 4689. ])

In [386]:
df4.head(3)

                   location  total_sqft  bath   price  bhk
0  Electronic City Phase II      1056.0   2.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0  120.00    4
2               Uttarahalli      1440.0   2.0   62.00    3

# feature engineering`

In [387]:
df5=df4.copy()
df5.head()

                   location  total_sqft  bath   price  bhk
0  Electronic City Phase II      1056.0   2.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0  120.00    4
2               Uttarahalli      1440.0   2.0   62.00    3
3        Lingadheeranahalli      1521.0   3.0   95.00    3
4                  Kothanur      1200.0   2.0   51.00    2

In [388]:
# now let's create a new column for per_sqft_price

In [389]:
df5['price_per_sqft']=df5['price']*100000/df5['total_sqft']

In [390]:
df5

                       location  total_sqft  bath   price  bhk  price_per_sqft
0      Electronic City Phase II      1056.0   2.0   39.07    2     3699.810606
1              Chikka Tirupathi      2600.0   5.0  120.00    4     4615.384615
2                   Uttarahalli      1440.0   2.0   62.00    3     4305.555556
3            Lingadheeranahalli      1521.0   3.0   95.00    3     6245.890861
4                      Kothanur      1200.0   2.0   51.00    2     4250.000000
...                         ...         ...   ...     ...  ...             ...
13315                Whitefield      3453.0   4.0  231.00    5     6689.834926
13316             Richards Town      3600.0   5.0  400.00    4    11111.111111
13317     Raja Rajeshwari Nagar      1141.0   2.0   60.00    2     5258.545136
13318           Padmanabhanagar      4689.0   4.0  488.00    4    10407.336319
13319              Doddathoguru       550.0   1.0   17.00    1     3090.909091

[13246 rows x 6 columns]

In [391]:
len(df5.location.unique())

1304

In [392]:
# trimming trailing spaces for better accuracy
df5.location=df5.location.apply(lambda x:x.strip())
location_stats=df5.groupby('location')['location'].agg('count').sort_values(ascending=False)
location_stats

location
Whitefield               535
Sarjapur  Road           392
Electronic City          304
Kanakpura Road           266
Thanisandra              236
                        ...
1 Giri Nagar               1
Kanakapura Road,           1
Kanakapura main  Road      1
Karnataka Shabarimala      1
whitefiled                 1
Name: location, Length: 1293, dtype: int64

In [393]:
len(location_stats[location_stats<=10])

1052

In [394]:
location_stats_lessthan_10=location_stats[location_stats<=10]
location_stats_lessthan_10

location
Basapura                 10
1st Block Koramangala    10
Gunjur Palya             10
Kalkere                  10
Sector 1 HSR Layout      10
                         ..
1 Giri Nagar              1
Kanakapura Road,          1
Kanakapura main  Road     1
Karnataka Shabarimala     1
whitefiled                1
Name: location, Length: 1052, dtype: int64

In [395]:
# lets consider this 1052 multiple location with <10  occurance as 'others'

In [396]:
#cheak out 
len(df5.location.unique())

1293

In [397]:
df5.location=df5.location.apply(lambda x : 'other' if x  in location_stats_lessthan_10 else x)
np.sort(df5.location.unique())
len(df5.location.unique())

242

In [403]:
df5.sample(10)

                       location  total_sqft  bath  price  bhk  price_per_sqft
3101                 Nagarbhavi      1350.0   2.0   54.6    3     4044.444444
9733                      other      1163.0   2.0   68.0    2     5846.947549
3160                     Hebbal      1053.0   2.0   48.0    2     4558.404558
2371   Electronics City Phase 1      2040.0   3.0  137.0    3     6715.686275
11400                     other      1166.0   6.0  135.0    6    11578.044597
3424                Bhoganhalli      1451.5   4.0  121.0    4     8336.203927
13091                     other       980.0   2.0   41.0    2     4183.673469
8686           Old Airport Road      1145.0   2.0   75.0    2     6550.218341
2227                      other      1050.0   2.0   43.0    2     4095.238095
4034               Rajaji Nagar      3436.0   6.0  500.0    4    14551.804424

# OUTLIER DETECTION AND REMOVAL